#### Terraform Initialization : success`
#### Terraform Plan : success`
<details><summary>Show Plan</summary>

```

[0m[1mdata.aws_subnets.selected: Reading...[0m[0m
[0m[1maws_security_group.ga_db_sg: Refreshing state... [id=sg-0eb298778b8e4f4e6][0m
[0m[1maws_security_group.ga_lb_sg: Refreshing state... [id=sg-0cdc9090ebd7ee77e][0m
[0m[1maws_security_group.ga_app_sg: Refreshing state... [id=sg-0f26b50dc70f745c6][0m
[0m[1maws_security_group_rule.allow_internet: Refreshing state... [id=sgrule-1622057071][0m
[0m[1maws_security_group_rule.allow_tcp_443: Refreshing state... [id=sgrule-344894980][0m
[0m[1maws_security_group_rule.allow_tcp_3306: Refreshing state... [id=sgrule-8615908][0m
[0m[1mdata.aws_subnets.selected: Read complete after 0s [id=ca-central-1][0m
[0m[1maws_db_subnet_group.data: Refreshing state... [id=ga-db-subnet-group][0m
[0m[1maws_db_instance.ga_mysql: Refreshing state... [id=db-EF6WL47QR3QEKFS4ZLVXPCPEDQ][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_security_group.ga_lb_sg[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group" "ga_lb_sg" {
      [33m~[0m[0m arn                    = "arn:aws:ec2:ca-central-1:654654488989:security-group/sg-0cdc9090ebd7ee77e" -> (known after apply)
      [33m~[0m[0m description            = "Allow traffic to Laod Balancer" [33m->[0m[0m "Allow traffic to Load Balancer" [31m# forces replacement[0m[0m
      [33m~[0m[0m egress                 = [] -> (known after apply)
      [33m~[0m[0m id                     = "sg-0cdc9090ebd7ee77e" -> (known after apply)
      [33m~[0m[0m ingress                = [
          [31m-[0m[0m {
              [31m-[0m[0m cidr_blocks      = [
                  [31m-[0m[0m "0.0.0.0/0",
                ]
              [31m-[0m[0m from_port        = 443
              [31m-[0m[0m ipv6_cidr_blocks = []
              [31m-[0m[0m prefix_list_ids  = []
              [31m-[0m[0m protocol         = "tcp"
              [31m-[0m[0m security_groups  = []
              [31m-[0m[0m self             = false
              [31m-[0m[0m to_port          = 443
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ] -> (known after apply)
        name                   = (sensitive value)
      [32m+[0m[0m name_prefix            = (known after apply)
      [33m~[0m[0m owner_id               = "654654488989" -> (known after apply)
        tags                   = {
            "Name" = (sensitive value)
        }
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_security_group_rule.allow_internet[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group_rule" "allow_internet" {
      [33m~[0m[0m id                       = "sgrule-1622057071" -> (known after apply)
      [33m~[0m[0m security_group_id        = "sg-0cdc9090ebd7ee77e" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m security_group_rule_id   = "sgr-0cb90eefe9e2920ba" -> (known after apply)
      [32m+[0m[0m source_security_group_id = (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_security_group_rule.allow_tcp_443[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group_rule" "allow_tcp_443" {
      [33m~[0m[0m id                       = "sgrule-344894980" -> (known after apply)
      [33m~[0m[0m security_group_rule_id   = "sgr-0ac7a6ce15fad7df6" -> (known after apply)
      [33m~[0m[0m source_security_group_id = "sg-0cdc9090ebd7ee77e" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 3 to add, 0 to change, 3 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @mathieupetersonGC, Action: `pull_request`*